while True:
    try:
        num = float(input('請輸入用電度數: '))
        output = 0
        if num <= 120:
            output = num*1.68
        elif num > 120 and num <= 330:
            output = 120*1.68 + (num-120)*2.16
        elif num > 330 and num <=500:
            output = 120*1.68 + 210*2.16 + (num-330)*3.03
        elif num > 500 and num <= 700:
            output = 120*1.68 + 210*2.16 + 170*3.03 + (num-500)*4.14
        elif num > 700 and num <= 1000:
            output = 120*1.68 + 210*2.16 + 170*3.03 + 200*4.14 + (num-700)*5.07
        else:
            output = 120*1.68 + 210*2.16 + 170*3.03 + 200*4.14 + 300*5.07 + (num-1000)*6.63
        print(f'用電 {num} 度，共 {output} 元')
    except:
        break

# 電費試算
# 
# Python test0003.py 
# 請輸入用電度數: 501
# 用電 501.0 度，共 1174.4400000000003 元
# 請輸入用電度數: 200
# 用電 200.0 度，共 374.4 元
# 請輸入用電度數: 154
# 用電 154.0 度，共 275.03999999999996 元
# 請輸入用電度數: 5000
# 用電 5000.0 度，共 30039.3 元
# 請輸入用電度數: 123456
# 用電 123456.0 度，共 815402.5800000001 元