c = int(input('輸入 1(攝氏) 或 2(華氏): '))
t = int(input('輸入溫度數值: '))

if c == 1:
    print(f'攝氏 {t} 度 等於 華氏 {9/5*t+32} 度')
else:
    print(f'華氏 {t} 度 等於 攝氏 {(t-32)/5*9} 度')



# 攝氏/華氏轉換
# 
# python test0004.py
# 輸入 1(攝氏) 或 2(華氏): 1
# 輸入溫度數值: 100
# 攝氏 100 度 等於 華氏 212.0 度
# PS C:\wsPython> python test0004.py
# 輸入 1(攝氏) 或 2(華氏): 1
# 輸入溫度數值: 0
# 攝氏 0 度 等於 華氏 32.0 度
# PS C:\wsPython> python test0004.py
# 輸入 1(攝氏) 或 2(華氏): 2
# 輸入溫度數值: 500
# 華氏 500 度 等於 攝氏 842.4 度
# PS C:\wsPython> python test0004.py
# 輸入 1(攝氏) 或 2(華氏): 2
# 輸入溫度數值: 0
# 華氏 0 度 等於 攝氏 -57.6 度